import { GENDER_TAGS, AGE_TAGS } from '../constants/index.mjs';

const Gender = GENDER_TAGS;
const Age = AGE_TAGS;

export const DEFAULT_NAMES = {
  human: {
    calishite: {
      name: {
        [Gender.MALE]: [
          'Асеир', 'Бардеид', 'Зашеир', 'Кхемед', 'Мехмен', 'Судейман', 'Хасеид',
        ],
        [Gender.FEMALE]: [
          'Атала', 'Джасмаль', 'Зашеида', 'Мейлиль', 'Сейдиль', 'Сейпора', 'Хама', 'Яшеира',
        ],
      },
      lastName: ['Баша', 'Джассан', 'Думеин', 'Кхалид', 'Мостана', 'Пашар', 'Рейн'],
    },
    chondathan: {
      name: {
        [Gender.MALE]: [
          'Горстаг', 'Грим', 'Дарвин', 'Дорн', 'Маларк', 'Морн', 'Рэндал', 'Стедд', 'Хельм', 'Эвендур',
        ],
        [Gender.FEMALE]: [
          'Арвин', 'Джессаиль', 'Керри', 'Лурин', 'Мири', 'Рован', 'Тесселе', 'Шандри', 'Эсвель',
        ],
      },
      lastName: ['Бакмэн', 'Грэйкасл', 'Дандрэгон', 'Толстаг', 'Эвенвуд', 'Эмблкроун'],
    },
    damaran: {
      name: {
        [Gender.MALE]: [
          'Айвор', 'Бор', 'Глэр', 'Григор', 'Иган', 'Козеф', 'Миваль', 'Орел', 'Павел', 'Сергор', 'Фодель',
        ],
        [Gender.FEMALE]: [
          'Алетра', 'Зора', 'Кара', 'Катернин', 'Мара', 'Натали', 'Ольма', 'Тана',
        ],
      },
      lastName: ['Берск', 'Дотск', 'Куленов', 'Марск', 'Немецк', 'Стараг', 'Чернин', 'Шемов'],
    },
    illuskan: {
      name: {
        [Gender.MALE]: [
          'Блас', 'Бран', 'Гет', 'Ландер', 'Лют', 'Малсер', 'Стор', 'Таман', 'Урт', 'Фрат', 'Эндер',
        ],
        [Gender.FEMALE]: [
          'Амафрея', 'Бетха', 'Вестра', 'Кетра', 'Мара', 'Ольга', 'Силифрей', 'Цефрея',
        ],
      },
      lastName: ['Брайтвуд', 'Виндривер', 'Лакмэн', 'Хелдер', 'Хорнрейвен', 'Штормвинд'],
    },
    mulan: {
      name: {
        [Gender.MALE]: [
          'Аот', 'Барерис', 'Кетот', 'Мумед', 'Рамас', 'Со-Кехур', 'Тхазар-Де', 'Урхур', 'Эхпутки',
        ],
        [Gender.FEMALE]: [
          'Аризима', 'Золис', 'Мурити', 'Нефис', 'Нулара', 'Сефрис', 'Тола', 'Умара', 'Чатхи',
        ],
      },
      lastName: ['Анкхалаб', 'Анскульд', 'Натандем', 'Серпет', 'Уутракт', 'Фезим', 'Хахпет'],
    },
    rashemi: {
      name: {
        [Gender.MALE]: [
          'Боривик', 'Владислак', 'Джандар', 'Канитар', 'Мадислак', 'Ральмевик', 'Фаургар', 'Шаумар',
        ],
        [Gender.FEMALE]: [
          'Имзель', 'Иммит', 'Наварра', 'Таммит', 'Файварра', 'Хульмарра', 'Шеварра', 'Юльдра',
        ],
      },
      lastName: ['Дайрнина', 'Илтазяра', 'Мурнитара', 'Стаянога', 'Улмокина', 'Чергоба'],
    },
    tethyrian: {
      name: {
        [Gender.MALE]: [
          'Горстаг', 'Грим', 'Дарвин', 'Дорн', 'Маларк', 'Морн', 'Рэндал', 'Стедд', 'Хельм', 'Эвендур',
        ],
        [Gender.FEMALE]: [
          'Арвин', 'Джессаиль', 'Керри', 'Лурин', 'Мири', 'Рован', 'Тесселе', 'Шандри', 'Эсвель',
        ],
      },
      lastName: ['Бакмэн', 'Грэйкасл', 'Дандрэгон', 'Толстаг', 'Эвенвуд', 'Эмблкроун'],
    },
    turami: {
      name: {
        [Gender.MALE]: [
          'Антон', 'Диеро', 'Маркон', 'Пьерон', 'Римардо', 'Ромеро', 'Салазар',
        ],
        [Gender.FEMALE]: [
          'Балама', 'Вонда', 'Джалана', 'Дона', 'Куара', 'Луиза', 'Марта', 'Селизе', 'Фаила',
        ],
      },
      lastName: ['Агосто', 'Асторио', 'Домине', 'Калабра', 'Маривальди', 'Писакар', 'Рамондо', 'Фалоне'],
    },
  },

  halfling: {
    name: {
      [Gender.FEMALE]: [
        'Бри', 'Вани', 'Верна', 'Джиллиан', 'Китри', 'Кора', 'Кэлли', 'Лавиния',
        'Лидда', 'Мерла', 'Недда', 'Паэла', 'Портия', 'Серафина', 'Трим', 'Шаэна', 'Эндри', 'Юфемия',
      ],
      [Gender.MALE]: [
        'Альтон', 'Андер', 'Гаррет', 'Кейд', 'Коррин', 'Лайл', 'Линдал', 'Майло',
        'Меррик', 'Осборн', 'Перрин', 'Рид', 'Роско', 'Уэллби', 'Финнан', 'Элдон', 'Эррих',
      ],
    },
    lastName: [
      'Вверхтормашкин', 'Высокохолм', 'Галькоброс', 'Добробочка', 'Зеленофляг',
      'Кустосбор', 'Лугодуг', 'Подветкин', 'Репейник', 'Чайнолист',
    ],
  },

  elf: {
    name: {
      [Gender.FEMALE]: [
        'Адрие', 'Альтеа', 'Анастрианна', 'Андрасте', 'Антинуа', 'Бетринна', 'Бирель',
        'Вадания', 'Валанте', 'Джеленетт', 'Друсилиа', 'Йелениа', 'Каэлинн', 'Квеленна',
        'Квиласи', 'Кейлет', 'Ксанафия', 'Лешанна', 'Лиа', 'Миали', 'Мэриэль', 'Найвара',
        'Сариэль', 'Силакви', 'Теирастра', 'Тиа', 'Фелосиаль', 'Шава', 'Шанайра', 'Энна',
      ],
      [Gender.MALE]: [
        'Адран', 'Арамиль', 'Араннис', 'Ауст', 'Аэлар', 'Бейро', 'Берриан', 'Варис',
        'Галинндан', 'Ивеллиос', 'Иммераль', 'Каррик', 'Куарион', 'Лаусиан', 'Миндартис',
        'Паэлиас', 'Перен', 'Риардон', 'Ролен', 'Совелисс', 'Тамиорн', 'Таривол', 'Терен',
        'Хадарай', 'Химо', 'Хэйян', 'Эниалис', 'Эрдан', 'Эреван',
      ],
      [Age.CHILD]: [
        'Ара', 'Брин', 'Валь', 'Дель', 'Иннил', 'Лаэль', 'Мелла', 'Наиль',
        'Наэрис', 'Раэль', 'Ринн', 'Сай', 'Силлин', 'Тиа', 'Фанн', 'Фаэн', 'Эрин',
      ],
    },
    lastName: [
      'Амакиир (Сверкающий Цветок)', 'Амастасия (Звёздный Цветок)', 'Галанодель (Лунный Шёпот)',
      'Ильфелкиир (Сверкающий Бутон)', 'Ксилосент (Золотой Лепесток)', 'Лиадон (Серебряный Лист)',
      'Найло (Ночной Бриз)', 'Сианодель (Лунный Ручей)', 'Холимион (Алмазная Роса)',
    ],
  },

  dragonborn: {
    name: {
      [Gender.FEMALE]: [
        'Акра', 'Бири', 'Даар', 'Джхери', 'Кава', 'Коринн', 'Мисханн', 'Нала',
        'Перра', 'Райанн', 'Сора', 'Сурина', 'Тхава', 'Уаджит', 'Фаридэ', 'Хавилар', 'Харанн',
      ],
      [Gender.MALE]: [
        'Арджхан', 'Баласар', 'Бхараш', 'Гхеш', 'Донаар', 'Крив', 'Медраш', 'Мехен',
        'Надарр', 'Панджед', 'Патрин', 'Рхогар', 'Тархун', 'Торинн', 'Хескан', 'Шамаш', 'Шединн',
      ],
    },
    clan: [
      'Версисатургиеш', 'Даардендриан', 'Делмирев', 'Драчедандион', 'Кепешкмолик',
      'Керрилон', 'Кимбатуул', 'Клестинсиаллор', 'Линксакасендалор', 'Мястан',
      'Неммонис', 'Нориксиус', 'Офиншталажир', 'Прексижандилин', 'Турнурот',
      'Фенкенкаьрадон', 'Шестенделиат', 'Яржерит',
    ],
  },

  dwarf: {
    name: {
      [Gender.FEMALE]: [
        'Артин', 'Бардрин', 'Вистра', 'Гуннлода', 'Гурдис', 'Дагнал', 'Диеза', 'Илде',
        'Катра', 'Кристид', 'Лифтраса', 'Мардред', 'Одхильд', 'Рисвин', 'Саннл', 'Торбера',
        'Торгга', 'Фалкрунн', 'Финеллен', 'Хельджа', 'Хлин', 'Эльдет', 'Эмбер',
      ],
      [Gender.MALE]: [
        'Адрик', 'Альберих', 'Баренд', 'Баэрн', 'Броттор', 'Бруенор', 'Вондал', 'Вэйт',
        'Гардаин', 'Даин', 'Даррак', 'Делг', 'Килдрак', 'Моргран', 'Орсик', 'Оскар',
        'Рангрим', 'Рюрик', 'Таклинн', 'Торадин', 'Тордек', 'Торин', 'Травок', 'Траубон',
        'Ульфгар', 'Фаргрим', 'Флинт', 'Харбек', 'Эберк', 'Эйнкиль',
      ],
    },
    clan: [
      'Балдерк', 'Боевой Молот', 'Горунн', 'Данкил', 'Железный Кулак', 'Крепкая Наковальня',
      'Ледяная Борода', 'Лодерр', 'Лютгер', 'Огненная Кузня', 'Рамнахейм', 'Стракелн',
      'Торунн', 'Унгарт', 'Холдерхек',
    ],
  },

  gnome: {
    name: {
      [Gender.FEMALE]: [
        'Бимпноттин', 'Бреена', 'Брина', 'Карамип', 'Карлин', 'Лорилла', 'Нисса',
        'Ода', 'Орла', 'Ройвин', 'Шамил', 'Эллирадкол',
      ],
      [Gender.MALE]: [
        'Алвин', 'Алстон', 'Боддинок', 'Брок', 'Бургелл', 'Варрин', 'Гимбл', 'Глим',
        'Джебеддо', 'Димбл', 'Келлен', 'Намфудл', 'Оррин', 'Пог', 'Сибо', 'Синдри',
        'Фонкин', 'Элдон', 'Эрки',
      ],
    },
    clan: [
      'Берен', 'Гаррик', 'Даергел', 'Мёрниг', 'Накл', 'Нингел', 'Раулнор',
      'Тимберс', 'Турен', 'Фолькор', 'Шеппен',
    ],
    nickname: [
      'Барсук', 'Босоног', 'Двазамок', 'Колотушка', 'Ку', 'Ним', 'Пеплосерд',
      'Пивохлёб', 'Плащ', 'Пок', 'Самоцвет', 'Стамблдак', 'Фниппер',
    ],
  },

  tiefling: {
    name: {
      [Gender.FEMALE]: [
        'Акта', 'Анакис', 'Брисеис', 'Дамая', 'Каллиста', 'Криелла', 'Лерисса',
        'Макария', 'Немея', 'Орианна', 'Риета', 'Фелая', 'Эа',
      ],
      [Gender.MALE]: [
        'Акменос', 'Амнон', 'Баракас', 'Дамакос', 'Йадос', 'Кайрон', 'Люцис',
        'Мелех', 'Мордай', 'Мортос', 'Пелайос', 'Скамос', 'Терай', 'Экемон',
      ],
      virtue: [
        'Безрассудство', 'Вера', 'Идеал', 'Искусство', 'Музыка', 'Мука', 'Надежда',
        'Напев', 'Нигде', 'Открытость', 'Отчаяние', 'Падаль', 'Поиск', 'Почтение',
        'Поэзия', 'Превосходство', 'Скорбь', 'Слава', 'Случайность', 'Страх', 'Усталость',
      ],
    },
  },

  'half-elf': {},
};